# 4)Напишите такую функцию computer_move(), которая сделала бы стратегию компьютера безупречной.
# Проверьте, можно ли создать непобедимого противника.

#Можно подправить действия пк при ходе юзера за второго игрока
#Использовать логические деревья
#Исправленный вариант в "Cross_zero_from_books" - добавил if на число 8 при ходе игрока для исключения
#Допущенной ничьи
#По итогу это не помогает, а только ломает логику, дополнительно по ходам в крсетиках ноликах смотрить ниже
#https://4brain.ru/blog/%D0%BA%D0%B0%D0%BA-%D0%B2%D1%8B%D0%B8%D0%B3%D1%80%D0%B0%D1%82%D1%8C-%D0%B2-%D0%BA%D1%80%D0%B5%D1%81%D1%82%D0%B8%D0%BA%D0%B8-%D0%BD%D0%BE%D0%BB%D0%B8%D0%BA%D0%B8/

